In [2]:
import pandas as pd
import numpy as np

In [3]:
d = {"a" : [1,2,np.nan], "b":[5,np.nan, np.nan],"c":[1,2,3]}

In [4]:
d

{'a': [1, 2, nan], 'b': [5, nan, nan], 'c': [1, 2, 3]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
#to drop the null values 
df.dropna()

     a    b  c
0  1.0  5.0  1

In [8]:
df.dropna(axis = 1)

   c
0  1
1  2
2  3

In [9]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df["a"].fillna(value = df["a"].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [16]:
df["a"]

0    1.0
1    2.0
2    NaN
Name: a, dtype: float64

# Groupby

In [20]:
data = {"company":['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
       "person": ['sam', 'charlie', 'amy', 'vanessa', 'carl', 'sarah'],
       "sales":[200,120,340,124,243,350]}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [24]:
#gropby company 
bycomp = df.groupby('company')

In [26]:
bycomp.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [27]:
bycomp.sum()

         sales
company
fb         593
goog       320
msft       464

In [28]:
bycomp.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [30]:
bycomp.sum().loc["fb"]

sales    593
Name: fb, dtype: int64

## Merging Joining and Concatenating

### Concatenation




<li>It basically glues the dataframes </li>
<li>We should make sure that the the data frames we are conctenating have same  </li>
<li>pd.conat()</li>

## Merging 
<li>The merge function allow us to merge Dataframes together using a similar logi as merging SQL Tables together </li>
<li>pd.merge(df1,df2, how = "inner", on = "key")</li>